#define _CRT_SECURE_NO_WARNINGS 1


//【问题描述】
//
//输入矩阵阶数n，给n阶矩阵的元素按行序由1到n* n顺序赋值，然后将其向右旋转90度，输出旋转后的矩阵。
//【输入形式】
//
//控制台输入阶数n。
//【输出形式】
//
//输出旋转90度后的矩阵，其中每个数字占4位字符的宽度，向右对齐。
//【样例输入】
//
//4
//【样例输出】
//
//13   9   5   1
//14  10   6   2
//15  11   7   3
//16  12   8   4
//【样例说明】
//
//输入整数n ＝ 4，输出旋转后的矩阵。

#include <stdio.h>

int main()
{
	int i, j,n,t = 1;
	scanf("%d", &n);
	int a[100][100];
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < n; j++)
		{
			a[i][j] = t;
			t++;
		}
	}
	for (j = 0;j < n;j++)
	{
		for (i = n -1;i >=0;i--)
		{
			printf("%4d", a[i][j]);
		}
		printf("\n");
	}
	return 0;
}